<template>
    <div>
        <b-container>
        <b-row>
            <b-col>
                <h1 class="title">Our Family Recepies</h1>
            </b-col>
        </b-row>
        <b-row class="recepie" dir="rtl">
            <b-col>
                <h3 class="headerLine">פתיתים אדומים עם קציצות</h3>
                <h5 class="headerLine">טעם של ילדות</h5>
                <p class="recepie-desc">
                   לכולנו יש מקום חם בלב לפתיתים, זה אחד המאכלים הראשונים שלמדנו להכין כבר בילדות
                    <br>
                   בתקופת המבחנים תמיד נמצא סיר של פתיתים אדומים עם קציצות במקרר, וזאת פשוט מנה מגניבה וטעימה 
                </p>
                <b-row>
                    <b-col cols="8">
                        <h5 class="sub-title">:מצרכים</h5>
                        <h6 class="sub-title">תערובת הקציצות</h6>
                        <ul>
                            <li>500-600 גרם בשר טחון טר</li>
                            <li>1 כפית מלח</li>
                            <li>1-2 כפיות פפריקה מתוקה או מעושנת</li>
                            <li>1 כפית אורגנו מיובש</li>                                                                               
                        </ul>
                        <h6 class="sub-title">לפתיתים</h6>
                        <ul>
                            <li>2-3 כפות שמן זית</li>
                            <li>2 בצלים בגודל בינוני (רגיל או סגול), קלופים</li>
                            <li>3-4 גזרים בגודל בינוני, קלופים</li>
                            <li>1 חבילה (500 גרם) פתיתים</li>
                            <li>2 כפות גדושות (בערך 100 גרם) רסק עגבניות</li>
                            <li>1-2 כוסות פאסאטה (מחית עגבניות חלקה, ניתן להמיר בקופסה קטנה אחת, 400 גרם, של עגבניות מרוסקות)</li>
                            <li>1/2 כפית מלח או יותר (לפי הטעם)</li>
                            <li>כפית אורגנו מיובש + כפית פפריקה מתוקה (רשות)</li>
                            <li>3-5 כוסות מים</li>
                        </ul>
                    </b-col>
                    <b-col cols="4">
                            <img src="../assets/ptitimandmeatballs/products.jpg" class="recipe-image" />
                    </b-col>                
                </b-row>
                <br/>
                <b-row>
                    <b-col cols="8">
                        <h5 class="sub-title">:אופן ההכנה</h5>
                        <h6 class="sub-title">לקציצות</h6>
                        <p class="rec-instructions">
                            מערבבים בקערה את הבשר הטחון יחד עם שאר המצרכים (פפריקה, אורגנו, מלח), למשך 1-2 דקות עד שמתקבלת תערובת אחידה ונוחה לעיצוב.
                            <br/>
                            בעזרת ידיים רטובות יוצרים קציצות קטנות (הכי קטנות שמסתדר לכם ליצור).
                        </p>                        
                        <h6 class="sub-title">מבשלים</h6>
                        <p class="rec-instructions">
                            חוצים לאורך ופורסים דק את הבצל. חוצים את הגזרים לאורך ופורסים דק.
                            <br/>
                            שמים בסיר בגודל בינוני (מומלץ בחום סיר נון סטיק) את הקציצות ושמן הזית. מטגנים מעל להבה גבוהה 2-3 דקות, עד שהקציצת הזהיבו מעט. מוציאים לצלחת או קערה בעזרת כף מחוררת.
                            <br/>
                            מוסיפים את הבצל הקצוץ והגזר אל השמן שנותר בסיר ומטגנים אגב ערבוב מעל להבה גבוהה 5 דקות, עד שהבצל התרכך מעט.
                            <br/>
                            מוסיפים לסיר את הפתיתים ומטגנים אותם אגב ערבוב 2-3 דקות נוספות.
                            <br/>
                            כשהפתיתים מעט הזהיבו, מוסיפים את הרסק, הפפריקה והאורגנו (אם משתמשים) ומטגנים דקה נוספת.
                            <br/>
                            וסיפים את המים (תתחילו ב-3 כוסות ותוסיפו עוד לפי הצורך) והפאסאטה, מחזירים פנימה את הקציצות ומביאים לרתיחה. מוסיפים את המלח (לפי הטעם) ומערבבים.
                            <br/>
                            מבשלים אגב ערבוב 13-17 דקות מעל להבה בינונית. כשבוחשים חשוב ממש להגיע לתחתית הסיר כדי לוודא ששום דבר לא נדבק או נשרף.
                            <br/>
                            אם רואים שהפתיתים ספגו את כל המים ותחתית הסיר מתחילה להידבק, תוסיפו עוד 1/2 כוס מים ותבחשו היטב. כך עושים בהדרגה
                            <br/>
                            במהלך הבישול עד שהפתיתים מבושלים לחלוטין.
                            <br/>
                            מערבבים ומגישים. אם רוצים אפשר רגע לפני ההגשה להוסיף עוד שמן זית.
                            <br/>
                        </p>
                    </b-col>
                    <b-col cols="4">
                        <img src="../assets/ptitimandmeatballs/step1.jpg" class="recipe-image" />
                        <img src="../assets/ptitimandmeatballs/step2.jpg" class="recipe-image" />
                    </b-col>
                </b-row>
                <br/>
                <b-row class="final-img">
                    <img src="../assets/ptitimandmeatballs/Done.jpg" class="recipe-done" />
                </b-row>
                <br>
                <br>
            </b-col>
        </b-row >
        <b-row class="recepie" dir="rtl">
            <b-col>
                <h3 class="headerLine">קציצות ירק מושלמות בתנור</h3>
                <h5 class="headerLine">עובדים עם מה שיש</h5>
            
            <p class="recepie-desc">
               קציצות ירק, או לביבות ירק (תלוי בתקופה בשנה) הן דרך מצוינת לנצל את מלאי הירקות שיש בבית. 
                <br>
                בכל שנה בתקופה חנוכה סבתא שלי מכינה את הקציצות האלה ואי אפשר להפסיק לזלול אותם
            </p>
            <b-row>
                <b-col cols="8">
                    <h5 class="sub-title">:מצרכים</h5>
                    <ul>
                        <li>בערך 1.5 ק"ג ירקות שונים שמתאימים לגירור (מוזמנים לשלב מהבאים: תפוחי אדמה, בטטה, גזר, דלעת, קישוא/זוקיני, קולרבי, שורש פטרוזיליה/שורש סלרי, בצל לבן/סגול, סלק)</li>
                        <li>כף מלח</li>
                        <li>2-3 ביצים גודל L</li>
                        <li>8-12 כפות פירורי לחם או שבולת שועל לדייסה</li>
                        <li>8-12 כפות גדושות קמח חומוס או קמח עדשים כתומות + 3 כפות שמן זית</li>
                        <li>קורט מלח – לתיבול לפי הטעם</li>
                        <li>3-4 כפות שמן (אני מעדיף שמן זית או שמן זרעי ענבים) לאפייה, או שמן לטיגון רדוד</li>
                    </ul>
                </b-col>
                <b-col cols="4">
                        <img src="../assets/levivot/vegis.jpg" class="recipe-image" />
                </b-col>                
            </b-row>
            <br/>
            <b-row>
                <b-col cols="8">
                    <h5 class="sub-title">:אופן ההכנה</h5>
                    <h6 class="sub-title">הכנת הירקות:</h6>
                    <p class="rec-instructions">
                        קולפים את הירקות (אישית אני לא קולף תפוחי אדמה, קישוא וזוקיני אז מוזמנים להשאיר אותם בקליפתם).
                        <br/>מגררים אותם בעזרת מעבד מזון (מומלץ) או בעזרת פומפייה. לפני הגירור במעבד מזון צריך לחתוך גס את הירקות ולוודא שהם נכנסים בול לפתח המכשיר.

                        <br/>אם גיררתם במעבד מזון ונשארו חתיכות ירק שלא גוררו, קוצצים אותן דק עם סכין ומוסיפים לשאר הירקות המגוררים.

                        <br/>שמים את הירקות המגוררים בקערה, מוסיפים את המלח ומערבבים היטב. בעזרת הידיים מועכים את הירקות כדי להתחיל להוציא מהם מים מיותרים.

                        <br/>סוחטים ביסודיות את המים העודפים מהירקות המגוררים אל תוך קערה נפרדת (אפשר לסחוט אותם עם הידיים כמו שאני מדגים בסרטון או לחלופין להניח את הירקות במסננת צפופה מעל קערה גדולה ואז למעוך את הירקות ככה שהמים יצאו החוצה.

                        <br/>שומרים את המים שסחטתם מהירקות בצד (ניתן להשתמש בהם לבישול אורז או בורגול).

                        <br/>מחזירים את הירקות המגוררים הסחוטים לקערה גדולה.
                    </p>
                    <h6 class="sub-title">יצירת לביבות</h6>
                    <p class="rec-instructions">
                        בקערה מערבבים את הירקות המוכנים יחד עם הביצים ופירורי הלחם/שיבולת השועל ומעט מלח.
                        <br/>
                        לוקחים כף גדושה מהתערובת ובעזרת ידיים רטובות, מעצבים צורת לביבה. מנסים להחזיק את הצורה בשתי אצבעות – אם זה מחזיק מצבכם מצוין.
                        <br/>
                        אם מרגיש רטוב מדי, מוסיפים עוד שבולת שועל/פירורי לחם. אם מרגיש יבש מדי, מוסיפים עוד ביצה בהדרגה ואיטיות.
                        <br/>חממים שמן לטיגון רדוד או חצי עמוק במחבת רחבה.

                        <br/>בעזרת ידיים רטובות יוצרים לביבות / קציצות מהתערובת שהכנתם.

                        <br/>מניחים בשמן בזהירות ועדינות 4-6 לביבות (חשוב לא לצופף את המחבת כדי לא להוריד את החום). מטגנים מעל חום בינוני-גבוה 3-4 דקות מצד אחד, ועוד 2-3 דקות מצד שני, עד הזהבה יפה.

                        <br/>כדי להפוך בקלות, כדאי להכין כף עץ ותרווד – הופכים את הלביבה בעזרת התרווד אל כף העץ, וכך מניחים אותה בעדינות חזרה בשמן בלי השפרצות.
                        
                        <br/>במהלך הטיגון חשוב להשגיח על את עוצמת החום – למשל אחרי שתוסיפו את הלביבות טמפרטורת השמן תרד ותצטרכו להגביר את החום, מצד שני אם אתם שומעים יותר מדי רחש מן המחבת, כדאי להוריד את החום ללהבה בינונית-נמוכה.

                        <br/>מוציאים לנייר סופג וממשיכים ליצור קציצות עם שאר התערובת.

                        <br/>מגישים וזוללים
                        
                        <br/>
                    </p>
                    
                </b-col>
                <b-col cols="4">
                    <img src="../assets/levivot/step2.jpg" class="recipe-image" />
                    <img src="../assets/levivot/step3.jpg" class="recipe-image" />
                </b-col>
            </b-row>
            <br/>
            <b-row class="final-img">
                <img src="../assets/levivot/Done.jpg" class="recipe-done" />
            </b-row>
            <br>
            <br>
            </b-col>
        </b-row>
        <b-row class="recepie" dir="rtl">
            <b-col>
                <h3 class="headerLine">אינג'רה ותבשיל קיק</h3>
                <h5 class="headerLine">מתחיל להתחממם פה</h5>
             <p class="recepie-desc">
               המטבח האתיופי עשיר במאכלים חמים וחריפים, המיועדים לאכילה בצוותא ובנחת. כל המשפחה אחראית על האוכל בבית
                <br>
                ההנאה היא בפשטות שבאכילה יחד, והייחוד הוא שכלי האכילה הם חלק מהארוחה עצמה
            </p>
            <b-row>
                <b-col cols="8">
                    <h5 class="sub-title">מצרכים:</h5>
                    <h6 class="sub-title">אינג'רה</h6>
                    <ul>
                        <li>חצי קילו טף בהיר/כהה (קמח אתיופי)</li>
                        <li>כוס וחצי מים פושרים</li>
                    </ul>
                    <h6 class="sub-title">קיק - מחית אפונה אתיופית</h6>
                    <ul>
                        <li>חצי קילו אפונה יבשה</li>
                        <li>2 שיני שום כתושות</li>
                        <li>בצל לבן קצוץ</li>
                        <li>כפית ג'ינג'ר טחון</li>
                        <li>תערובת תבלינים: חצי כפית מלח, רבע כפית הל, רבע כפית ציפורן, רבע כפית קצח, חצי כפית פלפל שחור, רבע כפית קמם (תבלין אתיופי)</li>
                        
                    </ul>
                </b-col>
                <b-col cols="4">
                        <img src="../assets/Ingera/step3.jpeg" class="recipe-image" />
                </b-col>                
            </b-row>
            <br/>
            <b-row>
                <b-col cols="8">
                    <h5 class="sub-title">אופן ההכנה:</h5>
                    <h6 class="sub-title">אינג'רה</h6>
                    <p class="rec-instructions">
                        מנפים לקערה גדולה את הקמח ושופכים את המים לאט תוך בחישה, מערבבים היטב את העיסה עד לקבלת מרקם אחיד. חשוב לוודא שלא יהיו גושים בכלל.
                        <br/>
                        מעבירים לכלי גדול עם מכסה אטום (התערובת תופחת וצריכה מקום) למשך הלילה לתסיסה, וצריך לתת לה לנוח לפחות עוד יממה שלמה.
                        <br/>
                        למחרת יתחיל תהליך הביעבוע, שתלוי מזג האוויר (בקיץ מספיק יומיים/שלושה, חורף לפחות ארבע/חמישה ימים). כאשר ישנם סימני תסיסה ובעבוע- התערובת מוכנה.
                        <br/>
                        מוסיפים כוס וחצי מים חמים (התחילו עם פחות והוסיפו עד כוס וחצי, לפי הצורך) עד לקבלת מרקם אחיד ורך (כמו פנקייק).
                        <br/>
                        מניחים בצד למשך 5-6 שעות נוספות עד שהעיסה מוכנה. תתחיל שוב תסיסה ויופיע קצף לבן. מערבבים את התערובת שוב בפעם האחרונה.
                        <br/>
                        מחממים מחבת גדולה (אם יש מגוגו, מחבת להכנת אינג'רה, עדיף. אפשר גם על מחבת נון סטיק) על אש גבוהה. משמנים את המחבת עם שמן פשתן/ שומשום/ שמן רגיל.
                        <br/>
                        בעזרת מצקת יוצקים את הבלילה בתנועות מעגליות, בשכבה דקה ואחידה על כל המחבת. כאשר הבצק מתחיל לבעבע - מתחיל להוציא "עיניים" - מכסים את המחבת עם מכסה למשך דקה / דקה וחצי, עד שהאינג'רה מוכנה.
                        <br/>
                        מוצאים בעדינות ומניחים בצד לקירור.
                        <br/>
                         חוזרים על התהליך שוב ושוב עד שנגמרת הבלילה. חשוב לזכור בכל פעם לנקות ולשמן מחדש.
                        <br/>
                        את האינג'רה אפשר לאכול עם כל ממרח או תבשיל. מומלץ עם תבשילים עשירים ברוטב.
                    </p>
                    <h6 class="sub-title">קיק - מחית אפונה אתיופית</h6>
                    <p class="rec-instructions">
                        שוטפים את האפונה היבשה ומשרים למשך לילה בקערה עם מים פושרים.
                        <br/>
                        לאחר ההשריה, מטגנים בצל, שום וג'ינג'ר טחון (לפי הטעם) בסיר.
                        <br/>
                        מוסיפים חצי קילו אפונה ומוסיפים כוס וחצי מים (אם יש צורך, אפשר להוסיף עוד קצת מים). 
                        <br/>
                         מוסיפים את תערובת התבלינים, ומבשלים על אש קטנה למשך כשעה, עד שהתבשיל מקבל סמיכות ורכות ומוכן.
                        <br/>
                        אפשר לטחון קלות עם בלנדר מוט או להגיש כפי שהוא.
                        <br/>
                    </p>
                </b-col>
                <b-col cols="4">
                    <img src="../assets/Ingera/step1.jpeg" class="recipe-image" />
                    <img src="../assets/Ingera/step2.jpeg" class="recipe-image" />
                    <img src="../assets/Ingera/step4.jpg" class="recipe-image" />
                </b-col>
            </b-row>
            <br/>
            <b-row class="final-img">
                <img src="../assets/Ingera/Done.jpg" class="recipe-done" />
            </b-row>
            <br>
            <br>
            </b-col>
        </b-row>
        </b-container>
    </div>
</template>

<script>
export default {
    name: 'FamilyRecepiesPage',

    data() {
        return {
            
        };
    },

    mounted() {
        
    },

    methods: {
        
    },
};
</script>

<style lang="scss" scoped>

.recepie-desc{
    text-align: center;   
}
.rec-instructions {
    text-align: right;
}
ul{
    text-align: right;
}
.title{
    padding-bottom: 8px;
    font-family: ‘Merriweather’, Georgia, serif;
    text-align: center;
    justify-content: center;
}
.recepie{
    border-top: 1px solid black;
}

.headerLine{
    text-align: center;
}

.recipe-image{
    width: 90%;
    padding: 3px;
}
.recipe-done{
    margin: auto;
    width: 50%;
}
.final-img{
    display: flex;
}
.sub-title{
    text-align: right;  
}
</style>